// =============================================
// Theme/MajorCyberPalette.ts
// =============================================
// Idisclosure#3で使用する色の組み合わせ
export const PALETTE = {
    // -------------------------------
    // 基準となる色
    // -------------------------------
    // 適当に決めたサイバーなシアン
    cyan: '52D2E0',
    cyan_op40: '#52D2E066',
    cyan_op10: '52D2E019',

    // -------------------------------
    // 同一色相配色であるアクセント色
    // -------------------------------
    // 同一色相配色であり明度のみ落とした黒色と純黒色
    black: '#001314',
    blackGlass: '#001314E0',
    gray: '#002729',
    grayGlass: '#002729E0',
    lightGray: '#7a7a7a',
    white: '#FFFFFF',
    whiteGlass: '#FFFFFF14',

    // -------------------------------
    // 同一トーン配色であるアクセント色
    // -------------------------------
    //ピンクに関する種類
    pink: '#E052D0',
    pink_op40: '#E052D066',
    pink_op10: '#E052D019',
    // 緑に関する種類
    green: '#7CE052',
    green_op40: '#7CE05266',
    green_op10: '#7CE05219',
    // 赤に関する種類
    red: '#E05252',
    red_op40: '#E0525266',
    red_op10: '#E0525219',
    // 黄色に関する種類
    yellow: '#E0C452',
    yellow_op40: '#E0C45266',
    yellow_op10: '#E0C45219',
    // 青に関する種類(仮)
    blue: '#5294E0',
    blue_op40: '#5294E066',
    blue_op10: '#5294E019',
    // 文字に関する色
};